{"id":"73828825","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data инженер","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Mediascope – исследовательская компания, которая работает на стыке медиа и ИТ. Более 25 лет мы анализируем аудиторию телевидения, интернета, радио и прессы, создаем уникальные аналитические продукты, которыми пользуются более 1000 российских медиа, рекламных компаний и рекламодателей. Наша задача – создавать и поддерживать индустриальные стандарты работы с данными на рынке медиа и рекламы, а также развивать медиаисследования в России.<br />Мы стремимся сохранять высокий темп развития компании и хотим, чтобы качество наших продуктов и нашей работы продолжало расти. Сейчас мы расширяем ИТ-команду и ищем нового коллегу на позицию <strong>Data engineer.</strong></p> <p><strong>О команде</strong></p> <p>Мы - команда дата-инженеров в отделе прикладной разработки платформы обработки данных. В наши рабочие обязанности в настоящее время входят разработка на Spark-SQL и Python, поддержка и доработка написанных на Java прикладных приложений, участие в разрешении инцидентов производства. Также мы принимаем участие в процессах приёмки ТЗ для нашего отдела, консультируем аналитиков платформы по особенностям технической реализации производственных компонент.</p> <p>Наша команда постоянно участвует в организации митапов внутри компании, занимается обучением соседних команд; а внутри команды идёт активный обмен опытом и знаниями.</p> <p><strong>Стек технологий, с которыми работаем: </strong>Hadoop, Airflow, Spark SQL, Python.</p> <p><strong>Чем предстоит заниматься:</strong></p> <ol> <li>Разработка и оптимизация прикладных компонент платформы (приложений, выполняющих преобразования данных, конвейеров последовательного исполнения этих приложений).</li> <li>Взаимодействие с системными аналитиками платформы - приёмка ТЗ на разработку компонент платформы, контроль за соблюдением архитектурных ограничений платформы, консультации по реализации компонент.</li> <li>Взаимодействие с командой эксплуатации платформы и дата-аналитиками платформы - разбор инцидентов производства, консультации по особенностям реализации прикладных компонент платформы.</li> <li>Консультация других команд сектора IT по особенностям реализации прикладных компонент платформы.</li> </ol> <p><strong>Что для этого потребуется:</strong></p> <ol> <li>Опыт разработки на python.</li> <li>Иметь базовые навыки обращения с консолью linux.</li> <li>Иметь базовый навык работы с git.</li> <li>Иметь уверенный средний уровнь знания произвольного диалекта SQL.</li> <li>Иметь базовые представления о распределённых хранилищах (можете прокомментировать CAP-концепцию), или есть желание &quot;вкатиться&quot; в эту тему.</li> <li>представление о системах управления производственными конвейерами (Apache Airflow, luiji).</li> </ol> <p>Будет плюсом:</p> <ol> <li>Готовность развиваться как python/pyspark-разработчик</li> <li>Опыт взаимодействия с hadoop-хранилищем/s3</li> <li>Опыт работы с Spark</li> <li>Опыт работы с Airflow</li> <li>Практический интерес к рабочим задачам, интересно разобраться, как работает тот или иной блок системы.</li> <li>Интересно быть инженером-&quot;многостаночником&quot;.</li> </ol> <p><strong>Мы предлагаем:</strong></p> <p>1. Возможность выбирать комфортный формат работы – офис, удаленка или гибрид, гибкое начало рабочего дня;<br />2. Конкурентную белую зарплату;<br />3. Официальное оформление, гарантию соблюдения трудового кодекса РФ, стабильную выплату заработной платы;<br />4. Расширенную медицинскую страховку (включая стоматологию)</p> <p><br /><strong>Работа в Mediascope – это</strong></p> <ol> <li>Сложные и нестандартные задачи. Погружайтесь в работу с данными в индустриях, где происходит все самое интересное: Медиа, Реклама, Web, Mobile.</li> <li>Современные технологии и эффективные подходы к работе. Применяйте актуальные инструменты для успешной работы.</li> <li>Непрерывное развитие. Получайте новые знания на профильных конференциях, обменивайтесь опытом с коллегами-экспертами и участвуйте в еженедельных образовательных митапах компании.</li> <li>Профессиональные и открытые коллеги. Работайте в команде сильных специалистов, основа которой - открытость, человечность, доверие, экологичность общения.</li> </ol> <p>Откликайтесь, обсудим все детали вакансии!</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Hadoop"},{"name":"Git"},{"name":"Spark"},{"name":"Python"},{"name":"airflow"},{"name":"luiji"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2739341","name":"Mediascope","url":"https://api.hh.ru/employers/2739341?host=hh.ru","alternate_url":"https://hh.ru/employer/2739341","logo_urls":{"240":"https://hhcdn.ru/employer-logo/5484933.png","90":"https://hhcdn.ru/employer-logo/5484932.png","original":"https://hhcdn.ru/employer-logo-original/966623.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2739341&host=hh.ru","trusted":true},"published_at":"2023-03-17T12:05:24+0300","created_at":"2023-03-17T12:05:24+0300","initial_created_at":"2022-12-14T18:43:57+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73828825","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73828825","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"b1","name":"B1 — Средний"}}]}