{"id":"75782775","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Lead Data Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Эта вакансия предполагает обязательную релокацию из России и Беларуси с возможностью работы в одном из наших офисов в Ирландии, Португалии, Кипре, Сербии, Черногории, Армении, Казахстане, либо удаленно из других стран.</strong></p> <p>В игры Playrix уже играют миллионы людей ежедневно. Чтобы это число превратилось в миллиард, мы активно вкладываемся в создание мощной автоматизированной системы по работе с креативами на рекламных каналах.</p> <p>Наша команда занимается разработкой и поддержкой программных продуктов для извлечения, трансформации, выгрузки и анализа данных.</p> <p>Объем данных в нашем Data Lake больше 2.5 петабайт: маркетинговые метрики, игровые события, параметры операционной деятельности. Мы делаем всё возможное, чтобы не возникало ни малейших сомнений в полноте, актуальности и достоверности информации, которую мы предоставляем. Особое внимание уделяем скорости обработки и качеству данных. Это позволяет нам принимать верные решения относительно развития наших игр!</p> <p>В нашу команду ищем Lead Data Engineer, готового развивать наши продукты.</p> <p><strong>Наши задачи</strong></p> <ul> <li> <p>подготовка источников данных для заказчика - маркетинг и игровая аналитика;</p> </li> <li> <p>разработка конвейера поставки данных в виде DAG процессов для Airflow/Luigi;</p> </li> <li> <p>внедрение моделей прогнозирования и ML в продакшен</p> </li> <li> <p>интеграция с сервисами партнеров для получения данных от них</p> </li> <li> <p>построение процессов data quality для новых и имеющихся источников.</p> </li> </ul> <p><strong>Наш стек</strong></p> <p>Наш основной язык программирования — Python. Для доступа к данным используем SQL. Datalake построен на S3, Parquet и Hive. В качестве DWH используем Redshift/PostgreSQL. Работаем в облачной инфраструктуре AWS. Используем решения мейнстримовых вендоров (Databricks, MonteCarlo, DBT). Практикуем serverless подход работы с ресурсами и горизонтальное масштабирование, используем предиктивные модели. Уделяем внимание рефакторингу и кода, и архитектуры. Для CI/CD процесса используем TeamCity.</p> <p><strong>Мы ожидаем</strong></p> <ul> <li> <p>технический бэкграунд в Python от 5 лет: навык проектирования фреймворков и библиотек, умение читать и анализировать код, опыт профилирования и оптимизации производительности/масштабируемости;</p> </li> <li> <p>опыт разработки data-driven приложений, выбора технического стека и субд;</p> </li> <li> <p>навыки работы с популярными DE/ML фреймворками: airflow, pandas, sqlalchemy, tensorflow, mlflow;</p> </li> <li> <p>навыки написания и оптимизации SQL запросов, умение работать с планами запросов, опыт работы с хранилищами разных архитектур: mpp, columnar, relation, hadoop, in-memory;</p> </li> <li> <p>опыт разработки в распределённых средах.</p> </li> </ul> <p><strong>Будет плюсом</strong></p> <ul> <li> <p>понимание работы облачных сервисов или знание стека AWS;</p> </li> <li> <p>знание предметной области маркетинга;</p> </li> <li> <p>опыт управления командой от 2 лет (6+ человек).</p> </li> </ul> <p><strong>Мы </strong><strong>предлагаем</strong></p> <p><strong>Заботу о здоровье</strong></p> <p>Компенсируем онлайн-сессии с психологом, открываем для вас и ваших детей ДМС со стоматологией и лечением от COVID-19. Организуем вакцинацию для тех, кому это важно.</p> <p><strong>Спорт и фитнес</strong></p> <p>Поддерживаем здоровый образ жизни и компенсируем покупку любых спортивных абонементов, подписку на фитнес-приложение или участие в марафонах.</p> <p><strong>Заботу о благополучии</strong></p> <p>Сохраняем 100% зарплату во время отпуска или больничного без лишних справок. А для особых случаев предоставим дополнительные выходные.</p> <p><strong>Удобное рабочее место</strong></p> <p>У нас есть все для комфортной работы, где бы вы не находились. В офисах — зоны отдыха и горячее питание, для удаленных сотрудников — доставка современной техники.</p> <p><strong>Развитие и обучение</strong></p> <p>Оплачиваем участие в профильных конференциях и курсах, регулярно проводим внутренние буткемпы и стажировки. А для личного развития предлагаем доступ к тысячам книг в онлайн-библиотеке и скидки на курсы английского языка.</p> <p><strong>Мероприятия и мерч</strong></p> <p>Конкурсы, спортивные челленджи, вечеринки, хакатоны и внутренние офлайн-ивенты для команд — каждый год мы проводим сотни мероприятий по всему миру.</p> <p><strong>Социальные проекты</strong></p> <p>Запускаем благотворительные проекты и поддерживаем идеи сотрудников в конкурсе грантов.</p>","branded_description":null,"vacancy_constructor_template":{"id":30567,"name":"Брендированный шаблон 1","top_picture":{"height":698,"width":1918,"path":"https://hhcdn.ru/branding-pictures/1466403.jpeg","blurred_path":"https://hhcdn.ru/branding-pictures-blurred/1466405.jpeg"},"bottom_picture":null},"key_skills":[{"name":"SQL"},{"name":"Python"},{"name":"MS SQL"},{"name":"PostgreSQL"},{"name":"Airflow"},{"name":"Luigi"},{"name":"Базы данных"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"114448","name":"Playrix","url":"https://api.hh.ru/employers/114448?host=hh.ru","alternate_url":"https://hh.ru/employer/114448","logo_urls":{"240":"https://hhcdn.ru/employer-logo/5814386.png","90":"https://hhcdn.ru/employer-logo/5814385.png","original":"https://hhcdn.ru/employer-logo-original/1048433.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=114448&host=hh.ru","trusted":true},"published_at":"2023-03-20T10:24:07+0300","created_at":"2023-03-20T10:24:07+0300","initial_created_at":"2023-01-13T14:43:21+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=75782775","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/75782775","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}