{"id":"76669711","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"ML-engineer (ranking and recs)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Привет! Я Ира, рекрутер компании Циан, крупнейшего в России сервиса для поиска недвижимости.</p> <p>У нас большая команда ML - 20+ человек. Это и сайнтисты и дата инженеры и своя MLOps платформа.</p> <ul> <li>Команда разделена на продуктовые стримы. Т.е. мы формируем самодостаточные команды (разработчики, аналитики, ML-инженеры) для решения задач бизнес-направления. С процессами интеграции моделей в продакшн на помогает команда МЛОпс платформы. Многое, что связано с деплоем моделей уже автоматизировано.</li> </ul> <p>И сейчас нам нужен +1 <strong>ML-инженер</strong> в команду Ранжирования и рекомендаций. Команда пилит рекомендательные системы на сайте и в приложении. Наши модели уже на довольно высоком уровне. Но мы не останавливаемся и постоянно делаем из хорошего лучшее :)</p> <p><strong>Проекты</strong></p> <ul> <li>Построение моделей ранжирования с учетом монетизации объявлений</li> <li>Развитие моделей персональных рекомендаций</li> <li>Построение моделей склонности пользователя к использованию конкретных сервисов</li> </ul> <p><strong>Задачи</strong></p> <ul> <li>Разработка и внедрение в продакшн моделей машинного обучения для улучшения пользовательского опыта</li> <li>Участие во внутрикомандных процессах.</li> <li>Коммуникация как с бизнес заказчиком так и с data-scientist-ами;</li> <li>периодически - проведение а/б экспериментов</li> </ul> <p><strong>Стек</strong></p> <ul> <li>Пишем преимущественно на python (numpy, scipy, pandas, sklearn, keras, pytorch);</li> <li>Активно пользуем экосистему Hadoop (pyspark, phoenix/hbase, hive, kafka), у нас свой кластер;</li> <li>Вычислительные ресурсы для разработки: в том числе машины;</li> <li>Luigi + самописные дополнения к Luigi для шедулинга тасок;</li> <li>Для технических метрик - Grafana, для бизнес метрик - Superset;</li> </ul> <p><strong>Мы видим на этой позиции человека, который</strong></p> <ul> <li>пишет легко читаемый и поддерживаемый код на Python</li> <li>имеет продвинутый уровень в SQL: оконные функции, оптимизация запросов;</li> <li>имеет опыт в Apache стеке: HDFS / Kafka / Spark;</li> <li><strong>имеет опыт в ранжировании и рекомендациях, выводил модели в прод</strong></li> <li>имеет базовые знания в NLP: трансформеры, tf-idf;</li> <li>имеет базовые знания CV: классификация, детекция, сегментация;</li> <li>DL: PyTorch / TensorFlow;</li> <li>умеет хорошо построить валидацию, проверить результаты и отвалидировать бизнес-смысл;</li> <li>выводил код в продакшн, желательно over / near - realtime.</li> </ul> <p><strong>Что мы предлагаем</strong></p> <ul> <li>Технический рост. У нас есть успешные примеры роста с инженерной точки зрения (разработка, архитектура приложений и сервисов), а так же с точки зрения МЛ: есть возможность консультироваться с командой и брать инициативу по реализации крупных и сложных проектов;</li> <li>Рост и развитие: в первые месяцы у каждого сотрудника есть ментор, после появляется личный план развития и возможность прокачивать soft/ hard skills на практике, обучении, конференциях;</li> <li>Плюшки: ДМС с первого дня (стоматология, госпитализация, полис ВЗР), ежегодная компенсация спорта, 5 day off в год, помимо основного отпуска.</li> </ul> <p>‼️ Нестрашно, если вы за границей: мы полностью распределенная компания и работаем из разных стран. Если вас не пугает разница во времени, можете работать из любой точки мира.</p> <p><strong>EXTRA</strong></p> <ul> <li> <p>Про процессы</p> <p>У нас уже довольно зрелые процессы. Нет большого количества встреч, пишем чистый код, регулярно проводим демо и ретро по итогам квартала. Обмениваемся опытом: проводим внутренние митапы, на которых делимся идеями и советуемся друг с другом. Развиваем собственную MLOps платформу, на которой реализуем жизненный цикл моделей в продакшн. В команде выстроен процесс грейдирования и постановки личных планов развития.</p> </li> </ul> <ul> <li>Этапы интервью <ol> <li>Общее знакомство по телефону с рекрутером минут на 15-20.</li> <li>Технические интервью с Тимлидом на 1.5 часа.</li> <li>Финал совместно с Head of ML, HR BP. Для нас очень важно взять в команду человека, с котором мы будем сходиться в ценностях.</li> </ol> </li> </ul> <ul> <li> <p>О Циан</p> </li> </ul> <p>Циан — публичная IT-компания, крупнейший в России сервис для поиска недвижимости, входит в мировой топ-10.</p> <p>Больше 20 лет мы помогаем быстрее решать вопросы с жилой и коммерческой недвижимостью: найти, оценить, купить, снять, продать, сдать и оформить сделку без рисков.</p> <p>Мы делаем сервисы, которые помогают владельцам недвижимости, застройщикам, агентам и обычным людям оптимизировать рутину поиска и продаж.</p> <p>Ежемесячная аудитория превышает 18,7 млн уникальных пользователей.</p> <p>Офисы компании расположены в Москве, Петербурге и Новосибирске, есть возможность выбрать любой режим посещения или работать вовсе удаленно фулл-тайм.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Hadoop"},{"name":"Spark"},{"name":"Python"},{"name":"SQL"},{"name":"Machine Learning"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"165","name":"Дата-сайентист"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1429999","name":"Циан","url":"https://api.hh.ru/employers/1429999?host=hh.ru","alternate_url":"https://hh.ru/employer/1429999","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3388809.png","240":"https://hhcdn.ru/employer-logo/3388810.png","original":"https://hhcdn.ru/employer-logo-original/736958.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1429999&host=hh.ru","trusted":true},"published_at":"2023-02-27T20:26:56+0300","created_at":"2023-02-27T20:26:56+0300","initial_created_at":"2023-02-06T15:12:31+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=76669711","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/76669711","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}