{"id":"76697648","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Python разработчик","insider_interview":null,"response_letter_required":true,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Мы – Компания, которая входит в «Реестр аккредитованных организаций осуществляющих деятельность в области информационных технологий»<br /><br /><strong>Кто мы?</strong></p> <p>Мы стартап образованный в июле 2020 года двумя выходцами их компании ЦИАН - Павлом Тарасовым (руководитель Data Science и Data Engineering) и Петром Марковым (директор по региональному развитию). Наша миссия - помогать поставщикам на маркетплейсы решать их рутинные проблемы автоматически, находить точки роста выручки и пользоваться ими, делать так, что деньги отданные за наш сервис с лихвой окупаются за счет той пользы которую мы даем.</p> <p><strong>Основные задачи, которые решает компания, которые могут стать твоими: </strong></p> <ul> <li> <p>Разрабатывать многопоточный нагруженный (тысячи RPS) скрапер данных на AWS-like (yandex cloud) стеке. Источников данных не много, но они очень большие (терабайты новых данных ежедневно) и важна точность</p> </li> <li> <p>Разрабатывать приложения в микросервисной архитектуре</p> </li> <li> <p>Собирать инструментарий, из которого аналитики и data scientist-ы смогут без bolier plate кода собирать удобные и красивые инструменты для поставщиков и работы с данными, делать zero-downtime автоматический деплой этих инструментов</p> </li> <li> <p>Менторить и обучить сотрудников, проводить code-review, выстраивать процессы деплоя, реагировать и оперативно решать проблемы на production</p> </li> </ul> <p>Наш стек: Python 3.8-3.10 (в основном 3.10), FastAPI, Postgres, Clickhouse, Redis, Trino, Severless, S3, SQS</p> <p>А еще мы:<br />- практикуем обязательны code review всех изменений<br />- уделяем большое внимание написанию тестов. Пишем юнит, функциональные (силами разработчиков) и end-2-end (силами QA-инженеров) тесты<br />- стараемся минимизировать написание boilerplate-кода (используем шаблоны микросервисов, разрабатываем внутренние библиотеки)<br />- внимательно относимся к качеству кода (используем линтеры, mypy и т.д.)</p> <p><strong>Нам важно что бы ты хотел:</strong></p> <ul> <li> <p>Делать лучший продукт на рынке. Быть уверенным что все наши сервисы дают клиенту правильные рекомендации и видеть как клиенты растут вместе с нами</p> </li> <li> <p>Решать сложные задачи и искать новые решения. Зачастую многие задачи непонятно как решить, как технически, так и продуктово - нужны люди способные придумать как и какие технологии применить для решения боли клиента</p> </li> <li> <p>Быть честным и открытым. Получать удовольствие от работы в сильной команде, а также привносить в команду позитивные изменения</p> </li> </ul> <p><strong>Мы видим на этой позиции человека, который</strong></p> <ul> <li> <p>Готов работать не по четкому ТЗ, а по бизнес требованиям и способен спроектировать масштабируемый поддерживаемый проект</p> </li> <li> <p>Умеет работать в сжатых сроках и отвечать за свой результат</p> </li> <li> <p>Имеет знания python, паттернов проектирования на микросервисной архитектуре, SQL, Unix/Linux, Docker</p> </li> <li> <p>Имеет опыт написания тестов (pytest);</p> </li> <li> <p>Умеет оптимизировать производительность приложения и запросов в базы данных;</p> </li> <li> <p>Понимает суть задачи и вносит минимальные необходимые изменения (без “переписать всё”)</p> </li> <li> <p>Работал с высоконагруженными проектами</p> </li> <li> <p>Мы видим на этой позиции человека, который знает как мониторить приложения в продакшене</p> </li> </ul> <p><strong>Будет плюсом:</strong></p> <ul> <li> <p>Знание AWS-стека, Serverless</p> </li> <li> <p>Опыт работы с кликхаусом и оптимизацией запросов</p> </li> </ul> <p><strong>Преимущества работы у нас:</strong></p> <ul> <li> <p>Возможность принимать участие в проектирование архитектуры и строить большую часть с 0</p> </li> <li> <p>Большая часть задач - новая разработка, а не поддержка легаси кода</p> </li> <li> <p>Овертаймы - не систематическая история. Они, конечно случаются - поэтому у нас официальный ненормированный рабочий день (31 день отпуска), кроме того овертаймы записываются и отгуливаются</p> </li> <li> <p>Работа удаленная (можно работать из любой точки мира)</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"ClickHouse"},{"name":"SQL"},{"name":"Linux"},{"name":"Flask"},{"name":"AWS"},{"name":"Pandas"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4872201","name":"ANABAR","url":"https://api.hh.ru/employers/4872201?host=hh.ru","alternate_url":"https://hh.ru/employer/4872201","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/912004.png","240":"https://hhcdn.ru/employer-logo/4088704.png","90":"https://hhcdn.ru/employer-logo/4088703.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4872201&host=hh.ru","trusted":true},"published_at":"2023-02-22T18:05:42+0300","created_at":"2023-02-22T18:05:42+0300","initial_created_at":"2023-02-07T09:27:57+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=76697648","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/76697648","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}