{"id":"77985241","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":{"id":"1947314-1947314-ancor","name":"ANCOR"},"contacts":null,"description":"<p>Data Analyst designs, develops and manages the Company information system, including data sources, data storage systems and reporting systems to obtain, store, process and report commercial information from a variety of sources. They work with business users and with Commercial Business Analysts to establish proper data architecture, automate ETL and reporting processes and create data reporting and validation tools.</p> <p>Data Analyst<strong> </strong>bears responsibility for proper documentation and version control of the information systems.</p> <p>Data Analyst is also responsible for the optimization and refactoring of the Company Data Warehouse and administration of the underlying IT infrastructure, in collaboration with external partners.</p> <p>Data Analyst is responsible either for integrating required reports into the Company information systems, including DWH and the Company BI system (QlikSense), or providing summary reporting and insights.</p> <p>In addition, Data Analystcan be involved in the development of various informational tools belonging to other business functions, wherever strong IT and systems expertise is required.</p> <p><strong>ETL Deployment and Automation:</strong></p> <ul> <li>Own the ETL (Extract-Transform-Load) process with third-party data providers, including research agencies, data service providers, distributors and direct customers, etc.</li> <li>Create and deploy automated ETL tools and procedures to ensure timely data collection from the providers in the most appropriate form;</li> <li>pre-processing, validation and screening of the data.</li> <li>Load the data into the Data Warehouse and ensure the integrity and validity of the updated datasets.</li> </ul> <p><strong>Data Warehouse / System Maintenance and Administration:</strong></p> <ul> <li>Work with providers to maintain Data Warehouse and other dedicated external servers: develop required functionality, manage and audit user roles and access rights, oversee the server administration from the Company side, monitor the software lifecycle and request required updates.</li> <li>Monitor the server and data warehouse performance and solve or prevent possible performance issues through code optimization, proper task scheduling or other means.</li> </ul> <p><strong>Data Architecture and Uniformity:</strong></p> <ul> <li>Build and maintain proper architecture of data stored at the Company Data Warehouse to ensure flexibility, scalability, reliability (including but not limited to proper version control) and performance.</li> <li>Build and maintain proper architecture of data in the Company BI System (QlikSense) to ensure flexibility, scalability and superior performance for both back-end tasks and end-user interactions.</li> <li>Document the changes to the system architecture, object and entity relations in accordance with industrial standards.</li> <li>Ensure uniformity of additional data sources being added to the Data Warehouse with the existing data architecture and document the data sources.</li> <li>Establish and maintain naming conventions and code style guidelines, document and communicate them to other system users, audit compliance.</li> </ul> <p><strong>System Refactoring and Optimization:</strong></p> <ul> <li>Review and optimize Data Warehouse code (SQL) and BI code to improve performance, readability and reliability.</li> <li>Lead the code review part of the change management process, i.e. ensure that existing code is properly adapted to the changes in business model, partners, utilized systems etc.</li> </ul> <p><strong>Tools &amp; Automation:</strong></p> <ul> <li>Create queries and procedures to extract, load, convert, combine, transform or map particular datasets with specific conditions to be used for internal, external or technical reports.</li> <li>Create macros and programs for the automation of routine tasks in the ComAnt department or for other business users based on business needs and in line with company strategy and policies.</li> </ul> <p><strong>Building Capabilities &amp; Culture:</strong></p> <p>Train the team on BI systems and other technical tools (e. g., advanced functions in Excel or Google Sheets) within area of responsibility and expertise.</p> <p><strong>Requirements:</strong></p> <ul> <li>Bachelor’s Degree (Analytics, Programming, Mathematics)</li> <li>Minimum of 3 years of prior experience as systems analyst or an SQL programmer in commercial environment</li> <li>Project management skills: development and monitoring of third-party informational, analytical and commercial systems</li> <li>Ability to build effective cooperation with providers to integrate BI systems, data change processes etc.</li> <li>Good understanding of Sales Process on E-commerce (Price, Promotion, Retail management) will be a plus</li> </ul> <p><strong>Tools</strong></p> <ul> <li>SQL - advanced knowledge as a <strong>must</strong>, including MS SQL Server administration.</li> <li>Experience with BI systems as a must, experience with QlikSense or QlikView as an advantage.</li> <li>Google Sheets, Google Big Query, Google Data Studio as an advantage</li> <li>MS Excel - advanced kills as a <strong>must,</strong> including developing macros in VBA <strong> </strong></li> <li>Python (incl. Pandas), R for analytical purposes and other programming languages (front-end and back-end) as <strong>an advantage</strong></li> </ul> <p>Knowledge of mathematical statistics and methods of statistical data analysis as<strong> an advantage</strong></p> <div> <div> <div> </div> </div> </div>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Data Analysis"},{"name":"SQL"},{"name":"VBA"},{"name":"MS SQL Server"},{"name":"Business Intelligence Systems"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"10","name":"Аналитик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1947314","name":"ANCOR","url":"https://api.hh.ru/employers/1947314?host=hh.ru","alternate_url":"https://hh.ru/employer/1947314","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/785003.png","240":"https://hhcdn.ru/employer-logo/3580904.png","90":"https://hhcdn.ru/employer-logo/3580903.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1947314&host=hh.ru","trusted":true},"published_at":"2023-03-13T15:12:23+0300","created_at":"2023-03-13T15:12:23+0300","initial_created_at":"2023-03-13T15:12:23+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=77985241","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/77985241","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}